if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "mas"
    brew "noti"
    # brew "trash"

    # Applications
    cask "visual-studio-code"
    # cask "kitty"
    cask "notion"
    cask "rocket"
    cask "timing"
    # cask "paw"
    cask "postman"
    cask "1password"
    cask "iterm2"
    cask "spotify"
    cask "vlc"
    cask "zoom"
    cask "vox"
    cask "slack"
    cask "swish"
    cask "mac-fan-control"

    # Browsers
    cask "firefox"
    cask "google-chrome"

    # Fonts
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-3270-nerd-font"

    # macOS App Store
    mas "Xcode", id: 497799835
elsif OS.linux?
    brew "xclip"
end

tap "homebrew/bundle"
tap "homebrew/core"

# packages
# brew "ack"
# brew "bat" maybe
# brew "cloc"
# brew "git-delta"
# brew "entr"
# brew "exa"
# brew "fd"
brew "fzf"
# brew "gh"
brew "git"
# brew "gnupg"
brew "grep"
# brew "highlight"
brew "htop"
# brew "jq"
# brew "lazydocker"
# brew "lazygit"
# brew "neofetch"
brew "neovim"
brew "python"
brew "rustup"
brew "node"
# brew "ripgrep"
# brew "shellcheck"
brew "tmux"
# brew "tree" # maybe
brew "vim"
# brew "wdiff" # maybe
brew "wget"
# brew "z" # maybe
brew "zsh"
